[{"title":"World Business Report, Businesses hit by Facebook outage","summary":"Following an extended outage of Facebook services we hear about the impact on businesses. And we examine the wider implications of the problems faced by WhatsApp, Instagram and Facebook, with Dan Cooper, senior editor at Engadget. Also in the programme, for four days in a row, Chinese warplanes have flown close to Taiwan. The island's president Tsai Ing-wen has warned in an article for Foreign Affairs magazine that there would be \"catastrophic\" consequences for peace and democracy in Asia if it ","link":"https:\/\/www.bbc.co.uk\/programmes\/p09xt3zg","pub_date":"2021-10-05 17:00:00","topic":"news"},{"title":"Fowl Business","summary":"Fowl business: if you've ever seen a guinea fowl rushing along, apparently compelled by extreme urgency, they're very funny! Happened several times today at Maple Glen Garden in Southland, New Zealand. And by the way, they can be noisy! ~pics taken when they were more chilled out. Click on any photo to enlarge. Committee meeting 🙂 Text and photos by Liz, Catchy heading by Nigel; Exploring Colour (2021)","link":"https:\/\/exploringcolour.wordpress.com\/2021\/10\/03\/fowl-business\/","pub_date":"2021-10-03 10:09:14","topic":"news"},{"title":"Small Business","summary":"Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.\n\nThis material may not be published, broadcast, rewritten, or redistributed. ©2021 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy","link":"https:\/\/www.foxbusiness.com\/small-business","pub_date":"2021-10-05 17:45:00","topic":"news"},{"title":"Transforming Business","summary":"With each passing year, each new disruption, each global challenge, what it means to be a transformative business leader evolves. In this special series, we spotlight visionaries who are making change around the world and explore the principles and playbooks that guide them.","link":"https:\/\/www.businessinsider.com\/tb\/the-people-transforming-business-in-2020-9","pub_date":"2021-10-08 20:00:00","topic":"news"},{"title":"Business+Tech","summary":"Technology has a profound impact on business — shaping the way it is conducted, how products and services are developed and offered, and how people interact with organizations. Our faculty, alumni, and centers and institutes are at the forefront of the intersection of business and technology, and are leading change through both research and practice. Business+Tech builds on these efforts, equipping students with a technology foundation they can use to positively impact business and society.  \n \n","link":"https:\/\/michiganross.umich.edu\/about\/business-tech","pub_date":"2021-10-06 17:05:40","topic":"science"},{"title":"Business of Marketing","summary":"Sort by: Most Recent Most Popular","link":"https:\/\/www.adweek.com\/category\/business-of-marketing\/","pub_date":"2021-10-07 23:30:00","topic":"business"},{"title":"Businesses must follow COVID-19 rules. It's good for … business","summary":"Ontario must enforce its COVID rules, Oct. 2No one wants to see businesses like gyms and restaurants suffer any more unnecessarily, but the requirement for proof of vaccination for entry is a necessity, most especially in these environments and any owner who openly declares that the rules do not apply at their establishment needs to pay the priceAnd this disregard to the rules demands a big price be paid.Common sense would indicate that most of those, who regularly frequent a gym, for instance, ","link":"https:\/\/www.thestar.com\/opinion\/letters_to_the_editors\/2021\/10\/09\/businesses-must-follow-covid-19-rules-its-good-for-business.html","pub_date":"2021-10-09 00:00:00","topic":"news"},{"title":"Shell Energy business-to-business brand expands across the U.S.","summary":"HOUSTON, Oct. 6, 2021 \/PRNewswire\/ -- MP2 Energy, LLC1, along with other affiliate entities2, will now go to market for commercial customers in the U.S. as Shell Energy, in a move demonstrating strong customer focus and signaling the strength of one energy brand dedicated to serving customers' complete energy transition needs. The Shell Energy brand will encompass the customer-facing elements under which affiliates market wholesale and retail power, natural gas and environmental products, demand","link":"https:\/\/finance.yahoo.com\/news\/shell-energy-business-business-brand-141300350.html","pub_date":"2021-10-06 14:13:00","topic":"news"},{"title":"Several District 18 Businesses Receive Back To Business Grant","summary":"\"We created the Back to Business Program to help people like them keep their doors open and build back even stronger. It's not too late to apply!\" (Shutterstock)ORLAND PARK, IL — Seven communities in the 18th District have received more than $200,000 in \"Back to Business\" grants, according to a news release from Illinois Senator Bill Cunningham. The senator congratulated the recipients and encouraged more local entrepreneurs to apply.\"I talked to many small business owners who struggled – and in","link":"https:\/\/patch.com\/illinois\/orlandpark\/several-district-18-businesses-receive-back-business-grant","pub_date":"2021-10-07 15:31:50","topic":"news"},{"title":"Shell Energy business-to-business brand expands across the U.S.","summary":"HOUSTON, Oct. 6, 2021 \/PRNewswire\/ -- MP2 Energy, LLC1, along with other affiliate entities2, will now go to market for commercial customers in the U.S. as Shell Energy, in a move demonstrating strong customer focus and signaling the strength of one energy brand dedicated to serving customers' complete energy transition needs. The Shell Energy brand will encompass the customer-facing elements under which affiliates market wholesale and retail power, natural gas and environmental products, demand","link":"https:\/\/www.prnewswire.com\/news-releases\/shell-energy-business-to-business-brand-expands-across-the-us-301394175.html","pub_date":"2021-10-06 14:13:00","topic":"news"},{"title":"Milwaukee Business Journal names 2021 Veterans in Business award winners","summary":"The Milwaukee Business Journal is honoring 11 Wisconsin veterans and one Milwaukee-area manufacturing firm with its 2021 Veterans in Business awards. The winners include Dick Leinenkugel, president and chief beer merchant at Jacob Leinenkugel Brewing Co.; Dirk Debbink, chairman and CEO of MSI General Corp.; Tarik Moody, director of digital strategy and innovation at 88Nine Radio Milwaukee; and Natalie Isensee, equity and inclusion manager at WPS Health Solutions. The program is designed to recog","link":"https:\/\/www.bizjournals.com\/milwaukee\/news\/2021\/10\/07\/milwaukee-business-journal-names-2021-veterans-in.html","pub_date":"2021-10-07 16:00:00","topic":"news"},{"title":"A BUSINESS VIEW OF NONDISCRIMINATION","summary":"Rob Egan, a local teacher, stepped before the Wichita City Council in July and asked for help.  'I can hide the fact if I want to, though I don't, that I'm gay,' Egan said, before holding up his cane. 'I cannot hide the fact that I have a disability and it has prevented me from getting jobs before. I spent a long time being ashamed of my disability. I will no longer be ashamed and I ask those who govern our city to affirm that by creating this option simply for recourse against discrimination.' ","link":"https:\/\/www.bizjournals.com\/wichita\/news\/2021\/10\/08\/ndo-returns-to-council.html","pub_date":"2021-10-08 10:00:00","topic":"news"},{"title":"Chum's Risky Business","summary":"S15 E4\n\nChum's Risky Business\n\n20m | 2017 | TV-PG | CC\n\nChumlee is holding out for a superhero when a seller brings in boxes upon boxes of inherited comic books. Rick learns you have to buy money to make money when some rare turn of the century currency hits his counter. Chumlee flips out when an antique pinball machine launches into the store.","link":"https:\/\/play.history.com\/shows\/pawn-stars\/season-15\/episode-4","pub_date":"2021-10-07 09:00:00","topic":"news"},{"title":"Kabul businesses at a standstill","summary":"Will aid for Afghanistan strengthen the Taliban?\n\nInternational donors have pledged more than $1 billion to avert an impending humanitarian crisis in Afghanistan. Although the Taliban won't handle the money directly, it could be spun as an endorsement of their regime.","link":"https:\/\/www.dw.com\/en\/kabul-businesses-at-a-standstill\/av-59420937","pub_date":"2021-10-06 09:00:00","topic":"news"},{"title":"PACCAR Business Update","summary":"October 04, 2021 05:05 PM Eastern Daylight Time BELLEVUE, Wash.--(BUSINESS WIRE)--The ongoing global semiconductor shortage continues to affect some industries including the automotive sector. The semiconductor shortage has reduced PACCAR's truck deliveries in the third quarter of 2021 by approximately 7,000 vehicles. PACCAR's third quarter 2021 truck deliveries are estimated to be approximately 33,000 vehicles, compared to 40,100 vehicles delivered in the second quarter of 2021.\n\nPACCAR anticip","link":"https:\/\/www.businesswire.com\/news\/home\/20211004005949\/en\/PACCAR-Business-Update","pub_date":"2021-10-04 21:05:00","topic":"tech"},{"title":"Business Editor's Notebook","summary":"Oct. 3—SINCE IT CLOSED more than 60 years ago, the old YMCA building in Portsmouth has sat empty as a vibrant downtown evolved all around it.\n\nRestaurateurs Peter and Michael Labrie have rechristened the four-story building as a music and culinary venue that will soon also be home to a contemporary art museum.\n\nJimmy's Jazz & Blues Club opened Thursday with two shows by the Joey DeFrancesco Trio, the first in a fast-growing schedule of national acts booked to play there this fall. A $300-per-per","link":"https:\/\/news.yahoo.com\/business-editors-notebook-just-time-085900034.html","pub_date":"2021-10-03 08:59:00","topic":"news"},{"title":"Investment inequality is damaging small businesses, British Business Bank says","summary":"The state-owned British Business Bank was set up in Sheffield in 2014. It found that only 1.5 per cent of equity investment went to its own region of Yorkshire and the Humber\n\nA disparity in equity funding opportunities across the regions of the UK is preventing small and medium-sized businesses from flourishing, the state-owned British Business Bank has found.\n\nBusinesses in four regions — London, the South East, the North West and the East — accounted for 86 per cent of equity deals since 2011","link":"https:\/\/www.thetimes.co.uk\/article\/investment-inequality-is-damaging-small-businesses-british-business-bank-says-gbmxsr8nt","pub_date":"2021-10-07 09:00:00","topic":"news"},{"title":"'Small businesses are in growth'","summary":"Ms Ovens reminisced on the outlook for entrepreneurs at the end of 2019: 'It's hard to put yourself in a place where Brexit was the biggest issue of the day. It is an issue, and we are seeing the result of some of that now, but we thought: ‘That is the worst it can get' but then COVID came along and we knew nothing.'There was a lot of uncertainty at the end of 2019, there was a sense of new decade new beginnings. Entrepreneurs are generally positive people but there was really a sense of ‘best f","link":"https:\/\/www.express.co.uk\/finance\/personalfinance\/1502068\/entrepreneur-small-business-Britain-success-story-exclusive","pub_date":"2021-10-09 03:01:00","topic":"gaming"},{"title":"Local businesses recognized","summary":"Oct. 7—SPRING LAKE — So many companies nationwide adapted their business models over the past year due to the COVID-19 pandemic.\n\nOne of those that thrived was Quality Life Science Logistics, a Spring Lake Township company that operates a fleet of refrigerated trucks, which have been instrumental in distributing the COVID-19 vaccine from the Pfizer plant in Kalamazoo to sites across the country.\n\nQuality Life Science Logistics was one of several innovative businesses recognized at the local Cham","link":"https:\/\/news.yahoo.com\/local-businesses-recognized-180300891.html","pub_date":"2021-10-07 18:03:00","topic":"science"},{"title":"The Business Benefits of GitOps","summary":"Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our User Agreement and Privacy Policy. Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our Privacy Policy and User Agreement for details.","link":"https:\/\/www.slideshare.net\/Pivotal\/the-business-benefits-of-gitops","pub_date":"2021-10-04 23:21:22","topic":"news"},{"title":"DW Business – Africa","summary":"Visit the new DW website\n\nTake a look at the beta version of dw.com. We're not done yet! Your opinion can help us make it better.","link":"https:\/\/www.dw.com\/en\/dw-business-africa\/av-59453459","pub_date":"2021-10-08 19:00:00","topic":"news"},{"title":"Biden putting small businesses out of business with vaccine mandates: McMahon","summary":"","link":"https:\/\/video.foxbusiness.com\/v\/6276067122001\/","pub_date":"2021-10-07 22:34:16","topic":"news"},{"title":"Fees  Merchant and Business","summary":"ActivityDescriptionFeeAccount Monitoring ServiceOptional Service29.95 USD set up fee19.95 USD per monthAdvanced Fraud Management FiltersOptional Service20.00 USD per month0.05 USD per transactionAdvanced Fraud Protection ServicesOptional Service10.00 USD per month0.05 USD per transactionAdditional Risk FactorsIf PayPal determines that your Account receives, or is likely to receive a disproportionately higher number of customer complaints, reversals, chargebacks, claims, or other indicators of a ","link":"https:\/\/www.paypal.com\/us\/webapps\/mpp\/merchant-fees","pub_date":"2021-10-05 05:14:00","topic":"tech"},{"title":"Business Confidence Falls According To CU Boulder Leeds Business Confidence Index","summary":"CU Boulder Leeds Business Confidence Index has downgraded their optimism about Colorado's economy. 13 minutes ago \nOutdoor Dining Extended In BoulderThe outdoor dining ordinance was expanded by the Boulder City Council through April 2022.5 minutes agoBusiness Confidence Falls According To CU Boulder Leeds Business Confidence IndexCU Boulder Leeds Business Confidence Index has downgraded their optimism about Colorado's economy.13 minutes agoAverage Cost Of Rent In Denver Rises $107Rent prices con","link":"https:\/\/denver.cbslocal.com\/video\/6066774-business-confidence-falls-according-to-cu-boulder-leeds-business-confidence-index\/","pub_date":"2021-10-05 17:00:12","topic":"news"},{"title":"Nationwide offer to Business Prime members can help protect small businesses","summary":"COLUMBUS, Ohio, Oct. 5, 2021 \/PRNewswire\/ -- Protecting their business – it's at the top of every small business owner's mind. While they know it's very important to ensure their business has all the insurance protection it needs, oftentimes the day-to-day needs of their companies take priority.\nTo help them assess their business's protection needs, Nationwide is offering its Coverage Assistant tool to eligible Business Prime members. Through the experience, members will take the assessment onli","link":"https:\/\/www.prnewswire.com\/news-releases\/nationwide-offer-to-business-prime-members-can-help-protect-small-businesses-301392123.html","pub_date":"2021-10-05 13:00:00","topic":"news"},{"title":"New Tiger Sport 660 – City & Sports","summary":"","link":"https:\/\/www.youtube.com\/watch?v=EUncD-aGr-0","pub_date":"2021-10-05 00:00:00","topic":"business"},{"title":"Sport Performance Analysis with a Focus on Racket Sports: A Review","summary":"Athletes, both professional and amateur, are always looking for ways to improve their performance. With the introduction and increasing availability of modern technologies and smart devices arose the need to measure and analyze performance, but likewise, the use of these innovations as a competitive advantage also arose. Scientific publications reflect the wide range of available approaches and technologies, as well as the growing interest in various sports. As a result, we concentrated on a sys","link":"https:\/\/www.mdpi.com\/2076-3417\/11\/19\/9212","pub_date":"2021-10-03 00:00:00","topic":"science"},{"title":"Women's Sports Foundation gala to stream on Yahoo Sports","summary":"Pictures of the premiership trophy in pieces on social media has left the NRL furious - and the Panthers with some explaining to do. Read more here.South Australian Police have reportedly sent Nick Kyrgios and his girlfriend to quarantine in different hotel rooms after they arrived back in the country. Read more here.Ad•StandardNewsThank you for your feedback. We will remove this and make the necessary changes.These Fishermen Had To Think Fast To Save Mama Bear And Her CubsAndy Murray couldn't b","link":"https:\/\/au.sports.yahoo.com\/womens-sports-foundation-gala-to-stream-on-yahoo-sports-230731652.html","pub_date":"2021-10-08 23:07:31","topic":"news"},{"title":"Daily Fantasy Sports App Launched for Casual Sports Fans","summary":"CHARLOTTE, N.C., Oct. 8, 2021 \/PRNewswire\/ -- Retired Carolina Panthers player Brenton Bersin and team are launching a new Daily Fantasy Sports (DFS) application, \"Outlast™ Daily Fantasy Sports.\" The new app gives fans an easy, commitment-free way to take part in the DFS phenomenon without worrying about season-long rosters, salary caps or seasoned sharks. \nThe app's trio of games features the first over\/under survival pool game in DFS. \"Outlast\" also has the highest prize multiplies and the mos","link":"https:\/\/www.prnewswire.com\/news-releases\/daily-fantasy-sports-app-launched-for-casual-sports-fans-301396269.html","pub_date":"2021-10-08 15:59:00","topic":"news"},{"title":"Women's sport: Sport can't hit the snooze button again","summary":"Sport, we have a problem.It might not be today's problem. But have or had a problem, did or still does, doesn't matter. Because the seed of the problem is deeply rooted.Lisa De Vanna in action for Australia. She said she was subject to bullying during her Matildas career.Credit:AP PhotoThe landmark Royal Commission into Institutional Responses to Child Sexual Abuse gave sport its own section. In its final report in 2017, it said it had heard from 408 survivors and about 344 sport and recreation ","link":"https:\/\/www.smh.com.au\/sport\/sport-can-t-hit-the-snooze-button-again-20211006-p58xrm.html","pub_date":"2021-10-06 07:30:50","topic":"sport"},{"title":"Welcome To The Sports Office","summary":"","link":"https:\/\/www.youtube.com\/watch?v=0Ft7seac0SM","pub_date":"2021-10-08 02:01:41","topic":"sport"},{"title":"Genius Sports to Activate In-Stadia Sports Betting Partnerships with Philadelphia Eagles","summary":"October 05, 2021 08:00 AM Eastern Daylight Time NEW YORK & LONDON--(BUSINESS WIRE)--Genius Sports Limited (NYSE:GENI) ('Genius Sports' or 'the Company'), announced today announced a new agreement with the Philadelphia Eagles to help activate the NFL team's sports betting partnerships.\n\n\n\nAs the NFL's exclusive distributor of real-time and official play-by-play statistics, proprietary Next Gen Stats (NGS) data and official sports betting data feed, Genius Sports will help to drive fan engagement ","link":"https:\/\/www.businesswire.com\/news\/home\/20211005005654\/en\/Genius-Sports-to-Activate-In-Stadia-Sports-Betting-Partnerships-with-Philadelphia-Eagles","pub_date":"2021-10-05 12:00:00","topic":"tech"},{"title":"Paragon Casino Resort And Betfred Sports Launch Sports Betting In Louisiana","summary":"State-of-the-art Sportsbook, the first of its kind in Louisiana, is open to gaming enthusiasts at 3 p.m. CST tomorrow, Wednesday, Oct. 6\n\nMARKSVILLE, La., Oct. 5, 2021 \/PRNewswire\/ -- Paragon Casino Resort is proud to announce a partnership with Betfred Sports, bringing sports betting to the top rated gaming destination in Central Louisiana – with betting now open to the public. Betfred Sports, a sports betting operator currently available in select U.S. states, is expanding to Louisiana with it","link":"https:\/\/finance.yahoo.com\/news\/paragon-casino-resort-betfred-sports-215700652.html","pub_date":"2021-10-05 21:57:00","topic":"news"},{"title":"SPORT X CORINTHIANS","summary":"","link":"https:\/\/www.youtube.com\/watch?v=oEHdZxmP8J4","pub_date":"2021-10-08 00:00:00","topic":"sport"},{"title":"Paragon Casino Resort And Betfred Sports Launch Sports Betting In Louisiana","summary":"MARKSVILLE, La., Oct. 5, 2021 \/PRNewswire\/ -- Paragon Casino Resort is proud to announce a partnership with Betfred Sports, bringing sports betting to the top rated gaming destination in Central Louisiana – with betting now open to the public. Betfred Sports, a sports betting operator currently available in select U.S. states, is expanding to Louisiana with its latest location through the addition of a Las Vegas-style sportsbook at The Draft Room at Paragon Casino Resort – the first of its kind ","link":"https:\/\/www.prnewswire.com\/news-releases\/paragon-casino-resort-and-betfred-sports-launch-sports-betting-in-louisiana-301393562.html","pub_date":"2021-10-05 21:57:00","topic":"news"},{"title":"Sports stars past and present supporting Tyson Fury – Saturday's sporting social","summary":"In this article:\n\nTyson Fury is preparing to fight Deontay Wilder for a third time (Bradley Collyer\/PA) (PA Archive)\n\nSports stars and clubs across the world continue to provide an insight into their lives on social media.\n\nHere, the PA news agency looks at some of the best examples from October 9.\n\nBoxing\n\nTyson Fury prepared for Deontay Wilder in WWE style.\n\nThis content is not available due to your privacy preferences. Update your settings here to see it.\n\nFury had plenty of support.\n\nThis co","link":"https:\/\/news.yahoo.com\/sports-stars-past-present-supporting-195017805.html","pub_date":"2021-10-09 19:50:17","topic":"news"},{"title":"Netflix Series Bad Sport Takes A Look At Some International Sports Scandals","summary":"October 6th, 2021, 09:19 am \n\nbeysactingcoach\n \nPremiering today, true crime and sports intersect in a docuseries that examines global controversies and scandals with firsthand accounts from those involved. Following Netflix's UNTOLD, there are six, 60-minute documentaries covering some of sports biggest scandals - like The Great Patriot Deflate got nothing on these. (Apologies if there was a post for this show already, I'll be happy to delete.)The scandals covered include: - 1994 Arizona State ","link":"https:\/\/ohnotheydidnt.livejournal.com\/121804711.html","pub_date":"2021-10-06 14:19:49","topic":"gaming"},{"title":"Sports psychologists: Price will help end the stigma around mental health in sports","summary":"No pain, no gain.\n\n\"What a terrible phrase that we've used for many years to describe our athletes,\" Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s -- and sums up a lot of what's still wrong with sports.\n\nA day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sport","link":"https:\/\/ca.sports.yahoo.com\/news\/sports-psychologists-price-help-end-212359119.html?src=rss","pub_date":"2021-10-08 21:23:59","topic":"sport"},{"title":"Sports psychologists: Price will help end the stigma around mental health in sports","summary":"No pain, no gain.'What a terrible phrase that we've used for many years to describe our athletes,' Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s -- and sums up a lot of what's still wrong with sports. A day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sports.'","link":"https:\/\/www.thestar.com\/sports\/hockey\/2021\/10\/08\/sports-psychologists-price-will-help-end-the-stigma-around-mental-health-in-sports.html","pub_date":"2021-10-08 21:23:59","topic":"news"},{"title":"Sports stars past and present supporting Tyson Fury – Saturday's sporting social","summary":"Sports stars and clubs across the world continue to provide an insight into their lives on social media.Here, the PA news agency looks at some of the best examples from October 9.BoxingTyson Fury prepared for Deontay Wilder in WWE style.Fury had plenty of support.Actions speak louder than words.FootballPremier League teams were missing it.Manchester United paid tribute to Marcus Rashford after his honorary doctorate from the University of Manchester.Liverpool's stars gave their thoughts for Blac","link":"https:\/\/www.independent.co.uk\/sport\/sports-deontay-wilder-tyson-fury-wwe-charles-leclerc-b1935496.html","pub_date":"2021-10-09 19:43:08","topic":"news"},{"title":"Price will help end the stigma around mental health in sports, sports psychologists say","summary":"No pain, no gain. 'What a terrible phrase that we've used for many years to describe our athletes,' Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s – and sums up a lot of what's still wrong with sports. A day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sports. ","link":"https:\/\/www.theglobeandmail.com\/sports\/hockey\/article-price-will-help-end-the-stigma-around-mental-health-in-sports-sports\/","pub_date":"2021-10-09 00:36:02","topic":"sport"},{"title":"mohammedan sporting: Mohammedan Sporting not 'intimidated' by FC Goa test in Durand Cup final","summary":"KOLKATA: The last time Mohammedan Sporting lifted the Durand Cup - beating ONGC 2-1 in the final in 2013 - Dipendu Biswas was a part of the team as a player. Ending the long wait for a trophy drought and with Pen Orji and Tolgay Ozbey - who scored one of the goals in the final held in New Delhi - in the side, Mohammedan Sporting followed it up with another trophy, IFA Shield.Ahead of facing FC Goa in the Durand Cup final on Sunday, Dipendu, now associated with the black-and-white brigade as a te","link":"https:\/\/timesofindia.indiatimes.com\/sports\/football\/top-stories\/mohammedan-sporting-not-intimidated-by-fc-goa-test-in-durand-cup-final\/articleshow\/86723679.cms","pub_date":"2021-10-03 06:22:00","topic":"news"},{"title":"This Date in Sports, Oct. 3","summary":"1942 — With a victory in the Jockey Club Gold Cup, Whirlaway becomes the first horse to amass more than $500,000 in lifetime earnings.1951 — Bobby Thomson hits a three-run homer off Ralph Branca of the Brooklyn Dodgers with one out in the bottom of the ninth to give the New York Giants a dramatic 5-4 playoff victory and the National League pennant. 1971 — Billie Jean King wins the Virginia Slims-Thunderbird tournament in Phoenix to become the first women tennis player to win $100,000 in one year","link":"https:\/\/apnews.com\/774a536d6b2347d0115c9dc64490811f","pub_date":"2021-10-03 09:30:00","topic":"news"},{"title":"This Date in Sports, Oct. 5","summary":"1900 — Britain's Harry Vardon wins the U.S. Open golf title, beating J.H. Taylor with a 313 total at the Chicago Golf Club.1985 — Eddie Robinson becomes college football's winningest coach as Grambling beats Prairie View A&M 27-7. It's Robinson's 324th career victory, one more than Paul 'Bear' Bryant had before he retired from Alabama after the 1982 season. 1991 — Fresno State ties an NCAA record for most points in a quarter, with 49 in the second period as it pounds New Mexico 94-17. Fresno Sta","link":"https:\/\/apnews.com\/14059e2759423f9d19c516ce98ba783d","pub_date":"2021-10-05 09:30:00","topic":"news"},{"title":"How Many Underwater Sports Are There?","summary":"Please support me and my articles by following me and checking out my gaming channel!!!You've heard of scuba and snorkeling but what about Octopush and underwater target shooting? That's what we thought. There are over a dozen underwater sports (and counting) that attract adventure seekers of all ages around the world.Just how many underwater sports are there and what are the most unique ones? If your curiosity is piqued, keep reading. This article explores underwater sports activities as well a","link":"https:\/\/medium.com\/@Tech_Breaker\/how-many-underwater-sports-are-there-699e4d15460","pub_date":"2021-10-04 23:17:25","topic":"entertainment"},{"title":"Saturday's prep sports roundup","summary":"SATURDAY CROSS COUNTRY • BOYS WILLMAR INVITATIONAL At Eagle Creek Golf Course • Hopkins 32, Perham 68, Willmar 89, Sartell-St. Stephen 114, Totino-Grace 124, Luverne 147, St. Anthony 163, Albany 165. Medalist (5K): Jakob McCleary, Perham, 16:06.2. CROSS COUNTRY • GIRLS WILLMAR INVITATIONAL At Eagle Creek Golf Course • Hopkins 69, Willmar 72, Marshall 77, Perham 80, Luverne 106, St. Anthony 158, Sartell-St. Stephen 176, Albany 187. Medalist (5K): Sydney Drevlow, Hopkins, 17:56.4. FOOTBALL BIG SOU","link":"https:\/\/www.startribune.com\/saturday-s-prep-sports-roundup\/600103198\/","pub_date":"2021-10-03 03:46:54","topic":"news"},{"title":"Netflix's ‘Bad Sport' Probes Sports' Wildest Scandals, from Drug Trafficking to Horse Murder","summary":"Netflix makes the smartest and most obvious strategic move possible by combining two of its favorite non-fiction things—true crime and sports—with Bad Sport, a six-part docuseries (Oct. 6) about some of the craziest athletic scandals of the past few decades. A consistently gripping affair that pinpoints greed and fame as universal motivators for wrongdoing, it doesn't deliver any novel bombshells about the depths of man's selfishness and avarice, both of which appear to be quite boundless. It do","link":"https:\/\/www.thedailybeast.com\/netflixs-bad-sport-probes-sports-wildest-scandals-from-drug-trafficking-to-horse-murder","pub_date":"2021-10-06 08:56:19","topic":"entertainment"},{"title":"SPORT 1 x 0 CORINTHIANS","summary":"","link":"https:\/\/www.youtube.com\/watch?v=m6OVd2JiM6w","pub_date":"2021-10-09 00:00:00","topic":"sport"},{"title":"NBC Sports EDGE Draft Evaluation","summary":"The App is Back! Don't forget to download the NBC Sports EDGE app to receive real-time player news, mobile alerts and track your favorite players. Plus, now you can check out articles and player cards. Get it here!The NBC Sports Edge Expert draft was held on Wednesday evening, and if you missed it, you can watch it here. These fantasy basketball experts all took part in a 12-team draft for a 9-category, head-to-head league with the following positions and categories:Roster Positions: PG, SG, G, ","link":"https:\/\/sports.yahoo.com\/nbc-sports-edge-draft-evaluation-052943231.html","pub_date":"2021-10-07 05:29:43","topic":"business"},{"title":"Shooting Para Sport Overall Highlights","summary":"","link":"https:\/\/www.youtube.com\/watch?v=LIxvwuGqfKA","pub_date":"2021-10-06 13:00:18","topic":"news"},{"title":"Technology","summary":"Around six hours after Facebook, WhatsApp and Instagram went down, service started coming back online, though coverage was still spotty. Facebook, Instagram and WhatsApp all suffered outages midday Monday, according to public statements from the three Facebook services. \"We're aware… YouTube will remove videos spreading misinformation on its platform about any approved vaccine, not only those aimed at preventing COVID-19. Instagram is pressing pause on plans to develop a version of its service f","link":"https:\/\/www.cnn.com\/2021\/10\/04\/tech\/facebook-instagram-whatsapp-outage\/index.html","pub_date":"2021-10-04 23:30:00","topic":"tech"},{"title":"Drayson Technologies Becomes Freevolt Technologies","summary":"October 04, 2021 05:13 AM Eastern Daylight Time LONDON--(BUSINESS WIRE)--Drayson Technologies today announces that it has become Freevolt Technologies. Seven years after its spin out from Imperial College London, Drayson Technologies has developed its core Freevolt™ proprietary radio frequency (RF) energy harvesting technology into a global award-winning suite of proprietary, patented and patent-pending technologies that recycle and harvest RF energy from radio transmission networks (NFC, cellul","link":"https:\/\/www.businesswire.com\/news\/home\/20211004005006\/en\/Drayson-Technologies-Becomes-Freevolt-Technologies","pub_date":"2021-10-04 09:13:00","topic":"tech"},{"title":"Technology","summary":"10 Things You Need to Know About the Metaverse\n\nThe metaverse is now big enough that all brand marketers need to be thinking about the role they want to play in it.","link":"https:\/\/www.adweek.com\/category\/technology","pub_date":"2021-10-04 14:30:00","topic":"tech"},{"title":"Disinformation technology","summary":"Patrick Chappatte is an editorial cartoonist. You can follow him on Twitter @PatChappatte.","link":"https:\/\/www.bostonglobe.com\/2021\/10\/06\/opinion\/disinformation-technology\/","pub_date":"2021-10-06 18:22:36","topic":"news"},{"title":"Hiperbaric Wins PMMI Technology Excellence Award for HPP In-Bulk Technology","summary":"Hiperbaric team wins PMMI's Technology Excellence Award for HPP In-Bulk Technology. From left: Jorge Coll, Sales, Hiperbaric; Roberto Peregrina, director, Hiperbaric, USA, and Glen A. Long, SVP, PMMI This technology is being used in Europe with great success and due to the latest trends in packaging sustainability, we remain positive that this will be another success story in the near future for the U.S., said Roberto Peregrina, director, Hiperbaric USA. MIAMI (PRWEB) October 06, 2021 Hiperbaric","link":"https:\/\/www.prweb.com\/releases\/hiperbaric_wins_pmmi_technology_excellence_award_for_hpp_in_bulk_technology\/prweb18243362.htm","pub_date":"2021-10-06 16:00:00","topic":"news"},{"title":"Update on Sale of Lomiko Technologies Inc. to Promethieus Technologies Inc. For $ 1,236,625","summary":"Home News Sports Living Arts & Entertainment Local Entertainment Games & Puzzles Movies Music National Entertainment Special Sections Classifieds Obituaries The Job Network Coronavirus News \n Copyright Business Wire 2021.","link":"https:\/\/www.businesswire.com\/news\/home\/20211005005706\/en\/","pub_date":"2021-10-05 12:17:07","topic":"news"},{"title":"Germany Futuristic Technology","summary":"MANILA, Philippines, Oct. 9, 2021 \/PRNewswire\/ -- After entering the market of Philippines at the early beginning of September, the flagship product of the Germany high-quality home appliance brand Gaabor - Gaabor smoke-free air fryer, has attracted extensive attention and received many praises from the Philippine people by virtue of its high-quality cost performance and fresh taste experience brought by its core technology. Recently, Gaabor smoke-free air fryer has blown a \"savoury\" hurricane o","link":"https:\/\/finance.yahoo.com\/news\/germany-futuristic-technology-gaabor-blows-033200225.html","pub_date":"2021-10-09 03:32:00","topic":"finance"},{"title":"Technology News and Updates","summary":"Minors are still able to either steal their parents' national IDs to obtain an adult gaming account, or pressure them into handing over the IDs voluntarily. Minors are still able to either steal their parents' national IDs to obtain an adult gaming account, or pressure them into handing over the IDs voluntarily. Technology firms offering financial services should be licensed and must adopt the ‘same business, same rules' approach, according to the top banker at the People's Bank of China. Time n","link":"https:\/\/www.scmp.com\/tech","pub_date":"2021-10-08 06:45:00","topic":"tech"},{"title":"Latest Technologies in 2021","summary":"Today's fast paced world relies on technology. 'Tech and Tech everywhere'.Right from the moment we wake up, switching off the alarm, brewing the coffee, getting ready, then heading towards the office, all these activities bend towards what? You know right! Life without technology is impossible and we must accept the fact that computers and laptops are an important source of livelihood. The future depends on person's ability to adapt and move with the advancement of technology.With the mission of","link":"https:\/\/wordstylistkiran.blogspot.com\/2021\/07\/latest-technology-in-2021.html","pub_date":"2021-10-06 17:38:07","topic":"entertainment"},{"title":"Borqs Technologies names","summary":"Javascript is Disabled\nYour current browser configurationis not compatible with this site.","link":"https:\/\/seekingalpha.com\/news\/3750496-borqs-technologies-names-new-cfo-from-within","pub_date":"2021-10-07 10:30:00","topic":"finance"},{"title":"Technology transfer 101","summary":"Photo illustrations by Jeffrey C. Chase\n\nUniversity of Delaware researchers have generated more than 500 inventions and secured 200 patents since 2008. Thirty startup companies have resulted from the licensing of UD technology, as well as 69 additional commercial licenses. One world-changing discovery to emerge from UD is literally right at your fingertips. UD researchers invented the multi-touch technology, a functionality that enables modern touchscreen capabilities found in smartphones, table","link":"https:\/\/www.udel.edu\/udaily\/2019\/september\/technology-transfer-commercializing-innovations","pub_date":"2021-10-03 19:45:00","topic":"tech"},{"title":"Is The Technology The Key To Success?","summary":"I often hear a very common statement from clients that has always struck me as interesting. The comment is, I have to use a different technology solution then my rivals, or else how can I possibly gain any advantage?\nI find that this reveals a basic flaw in the thinking of end user organizations. The key is not the vendor chosen. Rather it is what you do with that solution.\nNow don't get me wrong. There are definitely right and wrong solutions based on what a client needs for their environment. ","link":"https:\/\/blogs.gartner.com\/scott_nelson\/2021\/10\/04\/is-the-technology-the-key-to-success\/","pub_date":"2021-10-04 13:11:56","topic":"news"},{"title":"Technology Industry News","summary":"Sign up for alerts from The Irish Times Not Now I am interested\n\nJust click on 'Allow Notifications' on the message appearing on your browser to activate them.","link":"https:\/\/www.irishtimes.com\/business\/technology","pub_date":"2021-10-05 10:00:00","topic":"business"},{"title":"Topic  Technology & democracy","summary":"Topic | Technology & democracy | The Sydney Morning HeraldWe're sorry, this service is currently unavailable. Please try again later.AnalysisCoronavirus pandemicAs QR code use becomes normalised in a pandemic world, the real privacy issue is the broader tracking apparatus the codes are part of.2 hours agoby Tatum HunterAnalysisSocial mediaThere have been lots of talk and little action in the US when it comes to regulating social media giants such as Facebook. That could be about to change.Octobe","link":"https:\/\/www.smh.com.au\/topic\/technology---democracy-1lyc","pub_date":"2021-10-07 22:30:00","topic":"tech"},{"title":"ASCO Power Technologies Streamlines Transfer Switch Management with QR Code Technology","summary":"October 07, 2021 12:25 PM Eastern Daylight Time FLORHAM PARK, N.J.--(BUSINESS WIRE)--ASCO Power Technologies, the world's leading provider of critical power solutions, announces its application of Quick Response (QR) Codes to all models in its Transfer Switch Portfolio. This new feature provides users with direct digital access to serial number-linked documents using any smartphone or tablet that can scan QR codes.\n\nThe new QR Codes are on the new ASCO Identification Label applied to each transf","link":"https:\/\/www.businesswire.com\/news\/home\/20211007005806\/en\/ASCO-Power-Technologies-Streamlines-Transfer-Switch-Management-with-QR-Code-Technology","pub_date":"2021-10-07 16:25:00","topic":"tech"},{"title":"PAR Technology taps Raju Malhotra as Chief Product & Technology Officer (NYSE:PAR)","summary":"Javascript is Disabled\nYour current browser configurationis not compatible with this site.","link":"https:\/\/seekingalpha.com\/news\/3748933-par-technology-taps-raju-malhotra-as-chief-product-technology-officer","pub_date":"2021-10-05 11:49:00","topic":"finance"},{"title":"Nvidia Is Building the Future of Technology","summary":"Nvidia (NASDAQ:NVDA) invented the graphics processing unit (GPU) in 1999, revolutionizing the video game industry with ultrarealistic visuals. Unlike central processing units (CPUs), GPUs are designed to perform thousands of calculations simultaneously, meaning they excel at compute-intensive tasks involving big data and artificial intelligence.\nIn this Backstage Pass video, which aired Sept. 27, 2021, Motley Fool contributor Jose Najarro shares his thoughts on NVIDIA, and how the company will p","link":"https:\/\/www.fool.com\/investing\/2021\/10\/06\/nvidia-is-building-the-future-of-technology\/","pub_date":"2021-10-06 14:15:00","topic":"finance"},{"title":"Technology has not Defeated Geography","summary":"Nepal, Oct. 3 -- The case of atmospheric aerosol loading and repeated casualties from lightning in the Siwalik\/Churia range also proves this.The logicTechnology has eased human lives but not defeated geography. The case of repeated casualties from lightning and thunderstorm in the Siwalik\/Churia range and fewer cases of such casualties in the mountainous region is an example of how despite the emergence of 21st century technology, it has not defeated geography. Like the saying of Canadian Prime ","link":"https:\/\/www.msn.com\/en-xl\/asia\/nepal\/technology-has-not-defeated-geography\/ar-AAP52vB","pub_date":"2021-10-03 03:15:00","topic":"tech"},{"title":"Diagnosing brain pollution : technology","summary":"Subreddit dedicated to the news and discussions about the creation and use of technology and its surrounding issues.","link":"https:\/\/www.reddit.com\/r\/technology\/comments\/q0fqoa\/diagnosing_brain_pollution","pub_date":"2021-10-03 11:11:56","topic":"tech"},{"title":"Unlocking the banking technology workforce","summary":"DOWNLOADS Open interactive popup Article (PDF-808KB)\n\nIf banks are, as the familiar saying goes, technology companies as much as providers of products and services, are they managing their technology workforce accordingly? Indeed, just about every activity in modern banking organizations is powered by digital applications, informed by advanced analytics, or streamlined by automation. Discussions of apps, application programming interfaces (APIs), and the data-driven future are becoming almost as","link":"https:\/\/www.mckinsey.com\/industries\/financial-services\/our-insights\/unlocking-the-banking-technology-workforce","pub_date":"2021-10-06 00:00:00","topic":"finance"},{"title":"Research Topics in Information Technology","summary":"Join the community of over 1 million readers\n\nSign Up to Scribd to continue downloading\n\nSign up for a Scribd 30 day free trial to download this document plus get access to the world's largest digital library.\n\nCancel anytime.","link":"https:\/\/www.slideshare.net\/Phdtopiccom\/research-topics-in-information-technology","pub_date":"2021-10-08 11:26:57","topic":"news"},{"title":"Why is there no Nobel Prize in technology?","summary":"As the world focuses its attention on this year's recipients of the planet's most prestigious prize, the Nobel, it feels like something's missing from the list: technology.Swedish inventor Alfred Nobel established the prizes more than century ago with the instruction that his entire estate be used to endow 'prizes to those who, during the preceding year, shall have conferred the greatest benefit to mankind.' The categories laid out in his will—physics, chemistry, physiology or medicine, and peac","link":"https:\/\/qz.com\/1092758\/nobel-prize-2017-why-is-there-no-nobel-prize-in-technology\/","pub_date":"2021-10-07 22:15:00","topic":"news"},{"title":"ARISE Fellowships for technology developers","summary":"About the team\/job\nIn the frame of ARISE (Career Accelerator for Research Infrastructure Scientists) programme, we are looking for experienced professionals with a background in the fields of computation engineering and data sciences\/ imaging and optical engineering\/ mechanical engineering or molecular biotechnology, eager to develop novel technologies for life sciences and get trained to operate life science research infrastructures of tomorrow. \nThe programme receives funding from Horizon 2020","link":"https:\/\/www.nature.com\/naturecareers\/job\/arise-fellowships-for-technology-developers-european-molecular-biology-laboratory-embl-745420","pub_date":"2021-10-03 12:15:00","topic":"economics"},{"title":"Will technology solve education inequality?","summary":"As Harvard analyst, Deval Patrick, truthfully pointed out once: 'When there's inequity in learning, it's usually baked into life.'The quality of education we receive as children and young adults directly impacts the quality of life we enjoy later. A good education allows us to work, develop and ultimately live a more secure and happier life. Receiving an inadequate education, on the other hand, can significantly hinder our personal development.About the authorHugo Aguirre is the development and ","link":"https:\/\/www.techradar.com\/news\/will-technology-solve-education-inequality","pub_date":"2021-10-04 11:09:14","topic":"tech"},{"title":"KeyBanc Downgrades Akamai Technologies","summary":"#Price Action#Akam#GuardicoreTerms of UsePrivacy PolicyDo Not Sell My InfoHelp CenterAboutKeyBanc analyst Brandon Nispel downgraded Akamai Technologies Inc (NASDAQ:AKAM) to Sector Weight from Overweight without a price target following the company's acquisition of GuardiCore. Dilution from the acquisition \"details\" the near-term view on the shares, Nispel notes. The thesis that Akamai would utilize its \"significant\" free cash flow position to...markets.businessinsider.com","link":"https:\/\/markets.businessinsider.com\/news\/stocks\/keybanc-downgrades-akamai-technologies---read-why-1030840035","pub_date":"2021-10-04 10:50:40","topic":"news"},{"title":"World Business Report, Businesses hit by Facebook outage","summary":"Following an extended outage of Facebook services we hear about the impact on businesses. And we examine the wider implications of the problems faced by WhatsApp, Instagram and Facebook, with Dan Cooper, senior editor at Engadget. Also in the programme, for four days in a row, Chinese warplanes have flown close to Taiwan. The island's president Tsai Ing-wen has warned in an article for Foreign Affairs magazine that there would be \"catastrophic\" consequences for peace and democracy in Asia if it ","link":"https:\/\/www.bbc.co.uk\/programmes\/p09xt3zg","pub_date":"2021-10-05 17:00:00","topic":"news"},{"title":"Fowl Business","summary":"Fowl business: if you've ever seen a guinea fowl rushing along, apparently compelled by extreme urgency, they're very funny! Happened several times today at Maple Glen Garden in Southland, New Zealand. And by the way, they can be noisy! ~pics taken when they were more chilled out. Click on any photo to enlarge. Committee meeting 🙂 Text and photos by Liz, Catchy heading by Nigel; Exploring Colour (2021)","link":"https:\/\/exploringcolour.wordpress.com\/2021\/10\/03\/fowl-business\/","pub_date":"2021-10-03 10:09:14","topic":"news"},{"title":"Small Business","summary":"Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.\n\nThis material may not be published, broadcast, rewritten, or redistributed. ©2021 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy","link":"https:\/\/www.foxbusiness.com\/small-business","pub_date":"2021-10-05 17:45:00","topic":"news"},{"title":"Transforming Business","summary":"With each passing year, each new disruption, each global challenge, what it means to be a transformative business leader evolves. In this special series, we spotlight visionaries who are making change around the world and explore the principles and playbooks that guide them.","link":"https:\/\/www.businessinsider.com\/tb\/the-people-transforming-business-in-2020-9","pub_date":"2021-10-08 20:00:00","topic":"news"},{"title":"Business+Tech","summary":"Technology has a profound impact on business — shaping the way it is conducted, how products and services are developed and offered, and how people interact with organizations. Our faculty, alumni, and centers and institutes are at the forefront of the intersection of business and technology, and are leading change through both research and practice. Business+Tech builds on these efforts, equipping students with a technology foundation they can use to positively impact business and society.  \n \n","link":"https:\/\/michiganross.umich.edu\/about\/business-tech","pub_date":"2021-10-06 17:05:40","topic":"science"},{"title":"Business of Marketing","summary":"Sort by: Most Recent Most Popular","link":"https:\/\/www.adweek.com\/category\/business-of-marketing\/","pub_date":"2021-10-07 23:30:00","topic":"business"},{"title":"Businesses must follow COVID-19 rules. It's good for … business","summary":"Ontario must enforce its COVID rules, Oct. 2No one wants to see businesses like gyms and restaurants suffer any more unnecessarily, but the requirement for proof of vaccination for entry is a necessity, most especially in these environments and any owner who openly declares that the rules do not apply at their establishment needs to pay the priceAnd this disregard to the rules demands a big price be paid.Common sense would indicate that most of those, who regularly frequent a gym, for instance, ","link":"https:\/\/www.thestar.com\/opinion\/letters_to_the_editors\/2021\/10\/09\/businesses-must-follow-covid-19-rules-its-good-for-business.html","pub_date":"2021-10-09 00:00:00","topic":"news"},{"title":"Shell Energy business-to-business brand expands across the U.S.","summary":"HOUSTON, Oct. 6, 2021 \/PRNewswire\/ -- MP2 Energy, LLC1, along with other affiliate entities2, will now go to market for commercial customers in the U.S. as Shell Energy, in a move demonstrating strong customer focus and signaling the strength of one energy brand dedicated to serving customers' complete energy transition needs. The Shell Energy brand will encompass the customer-facing elements under which affiliates market wholesale and retail power, natural gas and environmental products, demand","link":"https:\/\/finance.yahoo.com\/news\/shell-energy-business-business-brand-141300350.html","pub_date":"2021-10-06 14:13:00","topic":"news"},{"title":"Several District 18 Businesses Receive Back To Business Grant","summary":"\"We created the Back to Business Program to help people like them keep their doors open and build back even stronger. It's not too late to apply!\" (Shutterstock)ORLAND PARK, IL — Seven communities in the 18th District have received more than $200,000 in \"Back to Business\" grants, according to a news release from Illinois Senator Bill Cunningham. The senator congratulated the recipients and encouraged more local entrepreneurs to apply.\"I talked to many small business owners who struggled – and in","link":"https:\/\/patch.com\/illinois\/orlandpark\/several-district-18-businesses-receive-back-business-grant","pub_date":"2021-10-07 15:31:50","topic":"news"},{"title":"Shell Energy business-to-business brand expands across the U.S.","summary":"HOUSTON, Oct. 6, 2021 \/PRNewswire\/ -- MP2 Energy, LLC1, along with other affiliate entities2, will now go to market for commercial customers in the U.S. as Shell Energy, in a move demonstrating strong customer focus and signaling the strength of one energy brand dedicated to serving customers' complete energy transition needs. The Shell Energy brand will encompass the customer-facing elements under which affiliates market wholesale and retail power, natural gas and environmental products, demand","link":"https:\/\/www.prnewswire.com\/news-releases\/shell-energy-business-to-business-brand-expands-across-the-us-301394175.html","pub_date":"2021-10-06 14:13:00","topic":"news"},{"title":"Milwaukee Business Journal names 2021 Veterans in Business award winners","summary":"The Milwaukee Business Journal is honoring 11 Wisconsin veterans and one Milwaukee-area manufacturing firm with its 2021 Veterans in Business awards. The winners include Dick Leinenkugel, president and chief beer merchant at Jacob Leinenkugel Brewing Co.; Dirk Debbink, chairman and CEO of MSI General Corp.; Tarik Moody, director of digital strategy and innovation at 88Nine Radio Milwaukee; and Natalie Isensee, equity and inclusion manager at WPS Health Solutions. The program is designed to recog","link":"https:\/\/www.bizjournals.com\/milwaukee\/news\/2021\/10\/07\/milwaukee-business-journal-names-2021-veterans-in.html","pub_date":"2021-10-07 16:00:00","topic":"news"},{"title":"A BUSINESS VIEW OF NONDISCRIMINATION","summary":"Rob Egan, a local teacher, stepped before the Wichita City Council in July and asked for help.  'I can hide the fact if I want to, though I don't, that I'm gay,' Egan said, before holding up his cane. 'I cannot hide the fact that I have a disability and it has prevented me from getting jobs before. I spent a long time being ashamed of my disability. I will no longer be ashamed and I ask those who govern our city to affirm that by creating this option simply for recourse against discrimination.' ","link":"https:\/\/www.bizjournals.com\/wichita\/news\/2021\/10\/08\/ndo-returns-to-council.html","pub_date":"2021-10-08 10:00:00","topic":"news"},{"title":"Chum's Risky Business","summary":"S15 E4\n\nChum's Risky Business\n\n20m | 2017 | TV-PG | CC\n\nChumlee is holding out for a superhero when a seller brings in boxes upon boxes of inherited comic books. Rick learns you have to buy money to make money when some rare turn of the century currency hits his counter. Chumlee flips out when an antique pinball machine launches into the store.","link":"https:\/\/play.history.com\/shows\/pawn-stars\/season-15\/episode-4","pub_date":"2021-10-07 09:00:00","topic":"news"},{"title":"Kabul businesses at a standstill","summary":"Will aid for Afghanistan strengthen the Taliban?\n\nInternational donors have pledged more than $1 billion to avert an impending humanitarian crisis in Afghanistan. Although the Taliban won't handle the money directly, it could be spun as an endorsement of their regime.","link":"https:\/\/www.dw.com\/en\/kabul-businesses-at-a-standstill\/av-59420937","pub_date":"2021-10-06 09:00:00","topic":"news"},{"title":"PACCAR Business Update","summary":"October 04, 2021 05:05 PM Eastern Daylight Time BELLEVUE, Wash.--(BUSINESS WIRE)--The ongoing global semiconductor shortage continues to affect some industries including the automotive sector. The semiconductor shortage has reduced PACCAR's truck deliveries in the third quarter of 2021 by approximately 7,000 vehicles. PACCAR's third quarter 2021 truck deliveries are estimated to be approximately 33,000 vehicles, compared to 40,100 vehicles delivered in the second quarter of 2021.\n\nPACCAR anticip","link":"https:\/\/www.businesswire.com\/news\/home\/20211004005949\/en\/PACCAR-Business-Update","pub_date":"2021-10-04 21:05:00","topic":"tech"},{"title":"Business Editor's Notebook","summary":"Oct. 3—SINCE IT CLOSED more than 60 years ago, the old YMCA building in Portsmouth has sat empty as a vibrant downtown evolved all around it.\n\nRestaurateurs Peter and Michael Labrie have rechristened the four-story building as a music and culinary venue that will soon also be home to a contemporary art museum.\n\nJimmy's Jazz & Blues Club opened Thursday with two shows by the Joey DeFrancesco Trio, the first in a fast-growing schedule of national acts booked to play there this fall. A $300-per-per","link":"https:\/\/news.yahoo.com\/business-editors-notebook-just-time-085900034.html","pub_date":"2021-10-03 08:59:00","topic":"news"},{"title":"Investment inequality is damaging small businesses, British Business Bank says","summary":"The state-owned British Business Bank was set up in Sheffield in 2014. It found that only 1.5 per cent of equity investment went to its own region of Yorkshire and the Humber\n\nA disparity in equity funding opportunities across the regions of the UK is preventing small and medium-sized businesses from flourishing, the state-owned British Business Bank has found.\n\nBusinesses in four regions — London, the South East, the North West and the East — accounted for 86 per cent of equity deals since 2011","link":"https:\/\/www.thetimes.co.uk\/article\/investment-inequality-is-damaging-small-businesses-british-business-bank-says-gbmxsr8nt","pub_date":"2021-10-07 09:00:00","topic":"news"},{"title":"'Small businesses are in growth'","summary":"Ms Ovens reminisced on the outlook for entrepreneurs at the end of 2019: 'It's hard to put yourself in a place where Brexit was the biggest issue of the day. It is an issue, and we are seeing the result of some of that now, but we thought: ‘That is the worst it can get' but then COVID came along and we knew nothing.'There was a lot of uncertainty at the end of 2019, there was a sense of new decade new beginnings. Entrepreneurs are generally positive people but there was really a sense of ‘best f","link":"https:\/\/www.express.co.uk\/finance\/personalfinance\/1502068\/entrepreneur-small-business-Britain-success-story-exclusive","pub_date":"2021-10-09 03:01:00","topic":"gaming"},{"title":"Local businesses recognized","summary":"Oct. 7—SPRING LAKE — So many companies nationwide adapted their business models over the past year due to the COVID-19 pandemic.\n\nOne of those that thrived was Quality Life Science Logistics, a Spring Lake Township company that operates a fleet of refrigerated trucks, which have been instrumental in distributing the COVID-19 vaccine from the Pfizer plant in Kalamazoo to sites across the country.\n\nQuality Life Science Logistics was one of several innovative businesses recognized at the local Cham","link":"https:\/\/news.yahoo.com\/local-businesses-recognized-180300891.html","pub_date":"2021-10-07 18:03:00","topic":"science"},{"title":"The Business Benefits of GitOps","summary":"Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our User Agreement and Privacy Policy. Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our Privacy Policy and User Agreement for details.","link":"https:\/\/www.slideshare.net\/Pivotal\/the-business-benefits-of-gitops","pub_date":"2021-10-04 23:21:22","topic":"news"},{"title":"DW Business – Africa","summary":"Visit the new DW website\n\nTake a look at the beta version of dw.com. We're not done yet! Your opinion can help us make it better.","link":"https:\/\/www.dw.com\/en\/dw-business-africa\/av-59453459","pub_date":"2021-10-08 19:00:00","topic":"news"},{"title":"Biden putting small businesses out of business with vaccine mandates: McMahon","summary":"","link":"https:\/\/video.foxbusiness.com\/v\/6276067122001\/","pub_date":"2021-10-07 22:34:16","topic":"news"},{"title":"Fees  Merchant and Business","summary":"ActivityDescriptionFeeAccount Monitoring ServiceOptional Service29.95 USD set up fee19.95 USD per monthAdvanced Fraud Management FiltersOptional Service20.00 USD per month0.05 USD per transactionAdvanced Fraud Protection ServicesOptional Service10.00 USD per month0.05 USD per transactionAdditional Risk FactorsIf PayPal determines that your Account receives, or is likely to receive a disproportionately higher number of customer complaints, reversals, chargebacks, claims, or other indicators of a ","link":"https:\/\/www.paypal.com\/us\/webapps\/mpp\/merchant-fees","pub_date":"2021-10-05 05:14:00","topic":"tech"},{"title":"Business Confidence Falls According To CU Boulder Leeds Business Confidence Index","summary":"CU Boulder Leeds Business Confidence Index has downgraded their optimism about Colorado's economy. 13 minutes ago \nOutdoor Dining Extended In BoulderThe outdoor dining ordinance was expanded by the Boulder City Council through April 2022.5 minutes agoBusiness Confidence Falls According To CU Boulder Leeds Business Confidence IndexCU Boulder Leeds Business Confidence Index has downgraded their optimism about Colorado's economy.13 minutes agoAverage Cost Of Rent In Denver Rises $107Rent prices con","link":"https:\/\/denver.cbslocal.com\/video\/6066774-business-confidence-falls-according-to-cu-boulder-leeds-business-confidence-index\/","pub_date":"2021-10-05 17:00:12","topic":"news"},{"title":"Nationwide offer to Business Prime members can help protect small businesses","summary":"COLUMBUS, Ohio, Oct. 5, 2021 \/PRNewswire\/ -- Protecting their business – it's at the top of every small business owner's mind. While they know it's very important to ensure their business has all the insurance protection it needs, oftentimes the day-to-day needs of their companies take priority.\nTo help them assess their business's protection needs, Nationwide is offering its Coverage Assistant tool to eligible Business Prime members. Through the experience, members will take the assessment onli","link":"https:\/\/www.prnewswire.com\/news-releases\/nationwide-offer-to-business-prime-members-can-help-protect-small-businesses-301392123.html","pub_date":"2021-10-05 13:00:00","topic":"news"},{"title":"New Tiger Sport 660 – City & Sports","summary":"","link":"https:\/\/www.youtube.com\/watch?v=EUncD-aGr-0","pub_date":"2021-10-05 00:00:00","topic":"business"},{"title":"Sport Performance Analysis with a Focus on Racket Sports: A Review","summary":"Athletes, both professional and amateur, are always looking for ways to improve their performance. With the introduction and increasing availability of modern technologies and smart devices arose the need to measure and analyze performance, but likewise, the use of these innovations as a competitive advantage also arose. Scientific publications reflect the wide range of available approaches and technologies, as well as the growing interest in various sports. As a result, we concentrated on a sys","link":"https:\/\/www.mdpi.com\/2076-3417\/11\/19\/9212","pub_date":"2021-10-03 00:00:00","topic":"science"},{"title":"Women's Sports Foundation gala to stream on Yahoo Sports","summary":"Pictures of the premiership trophy in pieces on social media has left the NRL furious - and the Panthers with some explaining to do. Read more here.South Australian Police have reportedly sent Nick Kyrgios and his girlfriend to quarantine in different hotel rooms after they arrived back in the country. Read more here.Ad•StandardNewsThank you for your feedback. We will remove this and make the necessary changes.These Fishermen Had To Think Fast To Save Mama Bear And Her CubsAndy Murray couldn't b","link":"https:\/\/au.sports.yahoo.com\/womens-sports-foundation-gala-to-stream-on-yahoo-sports-230731652.html","pub_date":"2021-10-08 23:07:31","topic":"news"},{"title":"Daily Fantasy Sports App Launched for Casual Sports Fans","summary":"CHARLOTTE, N.C., Oct. 8, 2021 \/PRNewswire\/ -- Retired Carolina Panthers player Brenton Bersin and team are launching a new Daily Fantasy Sports (DFS) application, \"Outlast™ Daily Fantasy Sports.\" The new app gives fans an easy, commitment-free way to take part in the DFS phenomenon without worrying about season-long rosters, salary caps or seasoned sharks. \nThe app's trio of games features the first over\/under survival pool game in DFS. \"Outlast\" also has the highest prize multiplies and the mos","link":"https:\/\/www.prnewswire.com\/news-releases\/daily-fantasy-sports-app-launched-for-casual-sports-fans-301396269.html","pub_date":"2021-10-08 15:59:00","topic":"news"},{"title":"Women's sport: Sport can't hit the snooze button again","summary":"Sport, we have a problem.It might not be today's problem. But have or had a problem, did or still does, doesn't matter. Because the seed of the problem is deeply rooted.Lisa De Vanna in action for Australia. She said she was subject to bullying during her Matildas career.Credit:AP PhotoThe landmark Royal Commission into Institutional Responses to Child Sexual Abuse gave sport its own section. In its final report in 2017, it said it had heard from 408 survivors and about 344 sport and recreation ","link":"https:\/\/www.smh.com.au\/sport\/sport-can-t-hit-the-snooze-button-again-20211006-p58xrm.html","pub_date":"2021-10-06 07:30:50","topic":"sport"},{"title":"Welcome To The Sports Office","summary":"","link":"https:\/\/www.youtube.com\/watch?v=0Ft7seac0SM","pub_date":"2021-10-08 02:01:41","topic":"sport"},{"title":"Genius Sports to Activate In-Stadia Sports Betting Partnerships with Philadelphia Eagles","summary":"October 05, 2021 08:00 AM Eastern Daylight Time NEW YORK & LONDON--(BUSINESS WIRE)--Genius Sports Limited (NYSE:GENI) ('Genius Sports' or 'the Company'), announced today announced a new agreement with the Philadelphia Eagles to help activate the NFL team's sports betting partnerships.\n\n\n\nAs the NFL's exclusive distributor of real-time and official play-by-play statistics, proprietary Next Gen Stats (NGS) data and official sports betting data feed, Genius Sports will help to drive fan engagement ","link":"https:\/\/www.businesswire.com\/news\/home\/20211005005654\/en\/Genius-Sports-to-Activate-In-Stadia-Sports-Betting-Partnerships-with-Philadelphia-Eagles","pub_date":"2021-10-05 12:00:00","topic":"tech"},{"title":"Paragon Casino Resort And Betfred Sports Launch Sports Betting In Louisiana","summary":"State-of-the-art Sportsbook, the first of its kind in Louisiana, is open to gaming enthusiasts at 3 p.m. CST tomorrow, Wednesday, Oct. 6\n\nMARKSVILLE, La., Oct. 5, 2021 \/PRNewswire\/ -- Paragon Casino Resort is proud to announce a partnership with Betfred Sports, bringing sports betting to the top rated gaming destination in Central Louisiana – with betting now open to the public. Betfred Sports, a sports betting operator currently available in select U.S. states, is expanding to Louisiana with it","link":"https:\/\/finance.yahoo.com\/news\/paragon-casino-resort-betfred-sports-215700652.html","pub_date":"2021-10-05 21:57:00","topic":"news"},{"title":"SPORT X CORINTHIANS","summary":"","link":"https:\/\/www.youtube.com\/watch?v=oEHdZxmP8J4","pub_date":"2021-10-08 00:00:00","topic":"sport"},{"title":"Paragon Casino Resort And Betfred Sports Launch Sports Betting In Louisiana","summary":"MARKSVILLE, La., Oct. 5, 2021 \/PRNewswire\/ -- Paragon Casino Resort is proud to announce a partnership with Betfred Sports, bringing sports betting to the top rated gaming destination in Central Louisiana – with betting now open to the public. Betfred Sports, a sports betting operator currently available in select U.S. states, is expanding to Louisiana with its latest location through the addition of a Las Vegas-style sportsbook at The Draft Room at Paragon Casino Resort – the first of its kind ","link":"https:\/\/www.prnewswire.com\/news-releases\/paragon-casino-resort-and-betfred-sports-launch-sports-betting-in-louisiana-301393562.html","pub_date":"2021-10-05 21:57:00","topic":"news"},{"title":"Sports stars past and present supporting Tyson Fury – Saturday's sporting social","summary":"In this article:\n\nTyson Fury is preparing to fight Deontay Wilder for a third time (Bradley Collyer\/PA) (PA Archive)\n\nSports stars and clubs across the world continue to provide an insight into their lives on social media.\n\nHere, the PA news agency looks at some of the best examples from October 9.\n\nBoxing\n\nTyson Fury prepared for Deontay Wilder in WWE style.\n\nThis content is not available due to your privacy preferences. Update your settings here to see it.\n\nFury had plenty of support.\n\nThis co","link":"https:\/\/news.yahoo.com\/sports-stars-past-present-supporting-195017805.html","pub_date":"2021-10-09 19:50:17","topic":"news"},{"title":"Netflix Series Bad Sport Takes A Look At Some International Sports Scandals","summary":"October 6th, 2021, 09:19 am \n\nbeysactingcoach\n \nPremiering today, true crime and sports intersect in a docuseries that examines global controversies and scandals with firsthand accounts from those involved. Following Netflix's UNTOLD, there are six, 60-minute documentaries covering some of sports biggest scandals - like The Great Patriot Deflate got nothing on these. (Apologies if there was a post for this show already, I'll be happy to delete.)The scandals covered include: - 1994 Arizona State ","link":"https:\/\/ohnotheydidnt.livejournal.com\/121804711.html","pub_date":"2021-10-06 14:19:49","topic":"gaming"},{"title":"Sports psychologists: Price will help end the stigma around mental health in sports","summary":"No pain, no gain.\n\n\"What a terrible phrase that we've used for many years to describe our athletes,\" Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s -- and sums up a lot of what's still wrong with sports.\n\nA day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sport","link":"https:\/\/ca.sports.yahoo.com\/news\/sports-psychologists-price-help-end-212359119.html?src=rss","pub_date":"2021-10-08 21:23:59","topic":"sport"},{"title":"Sports psychologists: Price will help end the stigma around mental health in sports","summary":"No pain, no gain.'What a terrible phrase that we've used for many years to describe our athletes,' Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s -- and sums up a lot of what's still wrong with sports. A day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sports.'","link":"https:\/\/www.thestar.com\/sports\/hockey\/2021\/10\/08\/sports-psychologists-price-will-help-end-the-stigma-around-mental-health-in-sports.html","pub_date":"2021-10-08 21:23:59","topic":"news"},{"title":"Sports stars past and present supporting Tyson Fury – Saturday's sporting social","summary":"Sports stars and clubs across the world continue to provide an insight into their lives on social media.Here, the PA news agency looks at some of the best examples from October 9.BoxingTyson Fury prepared for Deontay Wilder in WWE style.Fury had plenty of support.Actions speak louder than words.FootballPremier League teams were missing it.Manchester United paid tribute to Marcus Rashford after his honorary doctorate from the University of Manchester.Liverpool's stars gave their thoughts for Blac","link":"https:\/\/www.independent.co.uk\/sport\/sports-deontay-wilder-tyson-fury-wwe-charles-leclerc-b1935496.html","pub_date":"2021-10-09 19:43:08","topic":"news"},{"title":"Price will help end the stigma around mental health in sports, sports psychologists say","summary":"No pain, no gain. 'What a terrible phrase that we've used for many years to describe our athletes,' Gordon Bloom says of the saying that's been thrown around the sports world since the 1980s – and sums up a lot of what's still wrong with sports. A day after the NHL and National Hockey League Players' Association announced Carey Price was entering the NHLPA assistance program, Bloom applauded the 34-year-old Montreal Canadiens goalie for helping shatter the stigma around mental health in sports. ","link":"https:\/\/www.theglobeandmail.com\/sports\/hockey\/article-price-will-help-end-the-stigma-around-mental-health-in-sports-sports\/","pub_date":"2021-10-09 00:36:02","topic":"sport"},{"title":"mohammedan sporting: Mohammedan Sporting not 'intimidated' by FC Goa test in Durand Cup final","summary":"KOLKATA: The last time Mohammedan Sporting lifted the Durand Cup - beating ONGC 2-1 in the final in 2013 - Dipendu Biswas was a part of the team as a player. Ending the long wait for a trophy drought and with Pen Orji and Tolgay Ozbey - who scored one of the goals in the final held in New Delhi - in the side, Mohammedan Sporting followed it up with another trophy, IFA Shield.Ahead of facing FC Goa in the Durand Cup final on Sunday, Dipendu, now associated with the black-and-white brigade as a te","link":"https:\/\/timesofindia.indiatimes.com\/sports\/football\/top-stories\/mohammedan-sporting-not-intimidated-by-fc-goa-test-in-durand-cup-final\/articleshow\/86723679.cms","pub_date":"2021-10-03 06:22:00","topic":"news"},{"title":"This Date in Sports, Oct. 3","summary":"1942 — With a victory in the Jockey Club Gold Cup, Whirlaway becomes the first horse to amass more than $500,000 in lifetime earnings.1951 — Bobby Thomson hits a three-run homer off Ralph Branca of the Brooklyn Dodgers with one out in the bottom of the ninth to give the New York Giants a dramatic 5-4 playoff victory and the National League pennant. 1971 — Billie Jean King wins the Virginia Slims-Thunderbird tournament in Phoenix to become the first women tennis player to win $100,000 in one year","link":"https:\/\/apnews.com\/774a536d6b2347d0115c9dc64490811f","pub_date":"2021-10-03 09:30:00","topic":"news"},{"title":"This Date in Sports, Oct. 5","summary":"1900 — Britain's Harry Vardon wins the U.S. Open golf title, beating J.H. Taylor with a 313 total at the Chicago Golf Club.1985 — Eddie Robinson becomes college football's winningest coach as Grambling beats Prairie View A&M 27-7. It's Robinson's 324th career victory, one more than Paul 'Bear' Bryant had before he retired from Alabama after the 1982 season. 1991 — Fresno State ties an NCAA record for most points in a quarter, with 49 in the second period as it pounds New Mexico 94-17. Fresno Sta","link":"https:\/\/apnews.com\/14059e2759423f9d19c516ce98ba783d","pub_date":"2021-10-05 09:30:00","topic":"news"},{"title":"How Many Underwater Sports Are There?","summary":"Please support me and my articles by following me and checking out my gaming channel!!!You've heard of scuba and snorkeling but what about Octopush and underwater target shooting? That's what we thought. There are over a dozen underwater sports (and counting) that attract adventure seekers of all ages around the world.Just how many underwater sports are there and what are the most unique ones? If your curiosity is piqued, keep reading. This article explores underwater sports activities as well a","link":"https:\/\/medium.com\/@Tech_Breaker\/how-many-underwater-sports-are-there-699e4d15460","pub_date":"2021-10-04 23:17:25","topic":"entertainment"},{"title":"Saturday's prep sports roundup","summary":"SATURDAY CROSS COUNTRY • BOYS WILLMAR INVITATIONAL At Eagle Creek Golf Course • Hopkins 32, Perham 68, Willmar 89, Sartell-St. Stephen 114, Totino-Grace 124, Luverne 147, St. Anthony 163, Albany 165. Medalist (5K): Jakob McCleary, Perham, 16:06.2. CROSS COUNTRY • GIRLS WILLMAR INVITATIONAL At Eagle Creek Golf Course • Hopkins 69, Willmar 72, Marshall 77, Perham 80, Luverne 106, St. Anthony 158, Sartell-St. Stephen 176, Albany 187. Medalist (5K): Sydney Drevlow, Hopkins, 17:56.4. FOOTBALL BIG SOU","link":"https:\/\/www.startribune.com\/saturday-s-prep-sports-roundup\/600103198\/","pub_date":"2021-10-03 03:46:54","topic":"news"},{"title":"Netflix's ‘Bad Sport' Probes Sports' Wildest Scandals, from Drug Trafficking to Horse Murder","summary":"Netflix makes the smartest and most obvious strategic move possible by combining two of its favorite non-fiction things—true crime and sports—with Bad Sport, a six-part docuseries (Oct. 6) about some of the craziest athletic scandals of the past few decades. A consistently gripping affair that pinpoints greed and fame as universal motivators for wrongdoing, it doesn't deliver any novel bombshells about the depths of man's selfishness and avarice, both of which appear to be quite boundless. It do","link":"https:\/\/www.thedailybeast.com\/netflixs-bad-sport-probes-sports-wildest-scandals-from-drug-trafficking-to-horse-murder","pub_date":"2021-10-06 08:56:19","topic":"entertainment"},{"title":"SPORT 1 x 0 CORINTHIANS","summary":"","link":"https:\/\/www.youtube.com\/watch?v=m6OVd2JiM6w","pub_date":"2021-10-09 00:00:00","topic":"sport"},{"title":"NBC Sports EDGE Draft Evaluation","summary":"The App is Back! Don't forget to download the NBC Sports EDGE app to receive real-time player news, mobile alerts and track your favorite players. Plus, now you can check out articles and player cards. Get it here!The NBC Sports Edge Expert draft was held on Wednesday evening, and if you missed it, you can watch it here. These fantasy basketball experts all took part in a 12-team draft for a 9-category, head-to-head league with the following positions and categories:Roster Positions: PG, SG, G, ","link":"https:\/\/sports.yahoo.com\/nbc-sports-edge-draft-evaluation-052943231.html","pub_date":"2021-10-07 05:29:43","topic":"business"},{"title":"Shooting Para Sport Overall Highlights","summary":"","link":"https:\/\/www.youtube.com\/watch?v=LIxvwuGqfKA","pub_date":"2021-10-06 13:00:18","topic":"news"},{"title":"Technology","summary":"Around six hours after Facebook, WhatsApp and Instagram went down, service started coming back online, though coverage was still spotty. Facebook, Instagram and WhatsApp all suffered outages midday Monday, according to public statements from the three Facebook services. \"We're aware… YouTube will remove videos spreading misinformation on its platform about any approved vaccine, not only those aimed at preventing COVID-19. Instagram is pressing pause on plans to develop a version of its service f","link":"https:\/\/www.cnn.com\/2021\/10\/04\/tech\/facebook-instagram-whatsapp-outage\/index.html","pub_date":"2021-10-04 23:30:00","topic":"tech"},{"title":"Drayson Technologies Becomes Freevolt Technologies","summary":"October 04, 2021 05:13 AM Eastern Daylight Time LONDON--(BUSINESS WIRE)--Drayson Technologies today announces that it has become Freevolt Technologies. Seven years after its spin out from Imperial College London, Drayson Technologies has developed its core Freevolt™ proprietary radio frequency (RF) energy harvesting technology into a global award-winning suite of proprietary, patented and patent-pending technologies that recycle and harvest RF energy from radio transmission networks (NFC, cellul","link":"https:\/\/www.businesswire.com\/news\/home\/20211004005006\/en\/Drayson-Technologies-Becomes-Freevolt-Technologies","pub_date":"2021-10-04 09:13:00","topic":"tech"},{"title":"Technology","summary":"10 Things You Need to Know About the Metaverse\n\nThe metaverse is now big enough that all brand marketers need to be thinking about the role they want to play in it.","link":"https:\/\/www.adweek.com\/category\/technology","pub_date":"2021-10-04 14:30:00","topic":"tech"},{"title":"Disinformation technology","summary":"Patrick Chappatte is an editorial cartoonist. You can follow him on Twitter @PatChappatte.","link":"https:\/\/www.bostonglobe.com\/2021\/10\/06\/opinion\/disinformation-technology\/","pub_date":"2021-10-06 18:22:36","topic":"news"},{"title":"Hiperbaric Wins PMMI Technology Excellence Award for HPP In-Bulk Technology","summary":"Hiperbaric team wins PMMI's Technology Excellence Award for HPP In-Bulk Technology. From left: Jorge Coll, Sales, Hiperbaric; Roberto Peregrina, director, Hiperbaric, USA, and Glen A. Long, SVP, PMMI This technology is being used in Europe with great success and due to the latest trends in packaging sustainability, we remain positive that this will be another success story in the near future for the U.S., said Roberto Peregrina, director, Hiperbaric USA. MIAMI (PRWEB) October 06, 2021 Hiperbaric","link":"https:\/\/www.prweb.com\/releases\/hiperbaric_wins_pmmi_technology_excellence_award_for_hpp_in_bulk_technology\/prweb18243362.htm","pub_date":"2021-10-06 16:00:00","topic":"news"},{"title":"Update on Sale of Lomiko Technologies Inc. to Promethieus Technologies Inc. For $ 1,236,625","summary":"Home News Sports Living Arts & Entertainment Local Entertainment Games & Puzzles Movies Music National Entertainment Special Sections Classifieds Obituaries The Job Network Coronavirus News \n Copyright Business Wire 2021.","link":"https:\/\/www.businesswire.com\/news\/home\/20211005005706\/en\/","pub_date":"2021-10-05 12:17:07","topic":"news"},{"title":"Germany Futuristic Technology","summary":"MANILA, Philippines, Oct. 9, 2021 \/PRNewswire\/ -- After entering the market of Philippines at the early beginning of September, the flagship product of the Germany high-quality home appliance brand Gaabor - Gaabor smoke-free air fryer, has attracted extensive attention and received many praises from the Philippine people by virtue of its high-quality cost performance and fresh taste experience brought by its core technology. Recently, Gaabor smoke-free air fryer has blown a \"savoury\" hurricane o","link":"https:\/\/finance.yahoo.com\/news\/germany-futuristic-technology-gaabor-blows-033200225.html","pub_date":"2021-10-09 03:32:00","topic":"finance"},{"title":"Technology News and Updates","summary":"Minors are still able to either steal their parents' national IDs to obtain an adult gaming account, or pressure them into handing over the IDs voluntarily. Minors are still able to either steal their parents' national IDs to obtain an adult gaming account, or pressure them into handing over the IDs voluntarily. Technology firms offering financial services should be licensed and must adopt the ‘same business, same rules' approach, according to the top banker at the People's Bank of China. Time n","link":"https:\/\/www.scmp.com\/tech","pub_date":"2021-10-08 06:45:00","topic":"tech"},{"title":"Latest Technologies in 2021","summary":"Today's fast paced world relies on technology. 'Tech and Tech everywhere'.Right from the moment we wake up, switching off the alarm, brewing the coffee, getting ready, then heading towards the office, all these activities bend towards what? You know right! Life without technology is impossible and we must accept the fact that computers and laptops are an important source of livelihood. The future depends on person's ability to adapt and move with the advancement of technology.With the mission of","link":"https:\/\/wordstylistkiran.blogspot.com\/2021\/07\/latest-technology-in-2021.html","pub_date":"2021-10-06 17:38:07","topic":"entertainment"},{"title":"Borqs Technologies names","summary":"Javascript is Disabled\nYour current browser configurationis not compatible with this site.","link":"https:\/\/seekingalpha.com\/news\/3750496-borqs-technologies-names-new-cfo-from-within","pub_date":"2021-10-07 10:30:00","topic":"finance"},{"title":"Technology transfer 101","summary":"Photo illustrations by Jeffrey C. Chase\n\nUniversity of Delaware researchers have generated more than 500 inventions and secured 200 patents since 2008. Thirty startup companies have resulted from the licensing of UD technology, as well as 69 additional commercial licenses. One world-changing discovery to emerge from UD is literally right at your fingertips. UD researchers invented the multi-touch technology, a functionality that enables modern touchscreen capabilities found in smartphones, table","link":"https:\/\/www.udel.edu\/udaily\/2019\/september\/technology-transfer-commercializing-innovations","pub_date":"2021-10-03 19:45:00","topic":"tech"},{"title":"Is The Technology The Key To Success?","summary":"I often hear a very common statement from clients that has always struck me as interesting. The comment is, I have to use a different technology solution then my rivals, or else how can I possibly gain any advantage?\nI find that this reveals a basic flaw in the thinking of end user organizations. The key is not the vendor chosen. Rather it is what you do with that solution.\nNow don't get me wrong. There are definitely right and wrong solutions based on what a client needs for their environment. ","link":"https:\/\/blogs.gartner.com\/scott_nelson\/2021\/10\/04\/is-the-technology-the-key-to-success\/","pub_date":"2021-10-04 13:11:56","topic":"news"},{"title":"Technology Industry News","summary":"Sign up for alerts from The Irish Times Not Now I am interested\n\nJust click on 'Allow Notifications' on the message appearing on your browser to activate them.","link":"https:\/\/www.irishtimes.com\/business\/technology","pub_date":"2021-10-05 10:00:00","topic":"business"},{"title":"Topic  Technology & democracy","summary":"Topic | Technology & democracy | The Sydney Morning HeraldWe're sorry, this service is currently unavailable. Please try again later.AnalysisCoronavirus pandemicAs QR code use becomes normalised in a pandemic world, the real privacy issue is the broader tracking apparatus the codes are part of.2 hours agoby Tatum HunterAnalysisSocial mediaThere have been lots of talk and little action in the US when it comes to regulating social media giants such as Facebook. That could be about to change.Octobe","link":"https:\/\/www.smh.com.au\/topic\/technology---democracy-1lyc","pub_date":"2021-10-07 22:30:00","topic":"tech"},{"title":"ASCO Power Technologies Streamlines Transfer Switch Management with QR Code Technology","summary":"October 07, 2021 12:25 PM Eastern Daylight Time FLORHAM PARK, N.J.--(BUSINESS WIRE)--ASCO Power Technologies, the world's leading provider of critical power solutions, announces its application of Quick Response (QR) Codes to all models in its Transfer Switch Portfolio. This new feature provides users with direct digital access to serial number-linked documents using any smartphone or tablet that can scan QR codes.\n\nThe new QR Codes are on the new ASCO Identification Label applied to each transf","link":"https:\/\/www.businesswire.com\/news\/home\/20211007005806\/en\/ASCO-Power-Technologies-Streamlines-Transfer-Switch-Management-with-QR-Code-Technology","pub_date":"2021-10-07 16:25:00","topic":"tech"},{"title":"PAR Technology taps Raju Malhotra as Chief Product & Technology Officer (NYSE:PAR)","summary":"Javascript is Disabled\nYour current browser configurationis not compatible with this site.","link":"https:\/\/seekingalpha.com\/news\/3748933-par-technology-taps-raju-malhotra-as-chief-product-technology-officer","pub_date":"2021-10-05 11:49:00","topic":"finance"},{"title":"Nvidia Is Building the Future of Technology","summary":"Nvidia (NASDAQ:NVDA) invented the graphics processing unit (GPU) in 1999, revolutionizing the video game industry with ultrarealistic visuals. Unlike central processing units (CPUs), GPUs are designed to perform thousands of calculations simultaneously, meaning they excel at compute-intensive tasks involving big data and artificial intelligence.\nIn this Backstage Pass video, which aired Sept. 27, 2021, Motley Fool contributor Jose Najarro shares his thoughts on NVIDIA, and how the company will p","link":"https:\/\/www.fool.com\/investing\/2021\/10\/06\/nvidia-is-building-the-future-of-technology\/","pub_date":"2021-10-06 14:15:00","topic":"finance"},{"title":"Technology has not Defeated Geography","summary":"Nepal, Oct. 3 -- The case of atmospheric aerosol loading and repeated casualties from lightning in the Siwalik\/Churia range also proves this.The logicTechnology has eased human lives but not defeated geography. The case of repeated casualties from lightning and thunderstorm in the Siwalik\/Churia range and fewer cases of such casualties in the mountainous region is an example of how despite the emergence of 21st century technology, it has not defeated geography. Like the saying of Canadian Prime ","link":"https:\/\/www.msn.com\/en-xl\/asia\/nepal\/technology-has-not-defeated-geography\/ar-AAP52vB","pub_date":"2021-10-03 03:15:00","topic":"tech"},{"title":"Diagnosing brain pollution : technology","summary":"Subreddit dedicated to the news and discussions about the creation and use of technology and its surrounding issues.","link":"https:\/\/www.reddit.com\/r\/technology\/comments\/q0fqoa\/diagnosing_brain_pollution","pub_date":"2021-10-03 11:11:56","topic":"tech"},{"title":"Unlocking the banking technology workforce","summary":"DOWNLOADS Open interactive popup Article (PDF-808KB)\n\nIf banks are, as the familiar saying goes, technology companies as much as providers of products and services, are they managing their technology workforce accordingly? Indeed, just about every activity in modern banking organizations is powered by digital applications, informed by advanced analytics, or streamlined by automation. Discussions of apps, application programming interfaces (APIs), and the data-driven future are becoming almost as","link":"https:\/\/www.mckinsey.com\/industries\/financial-services\/our-insights\/unlocking-the-banking-technology-workforce","pub_date":"2021-10-06 00:00:00","topic":"finance"},{"title":"Research Topics in Information Technology","summary":"Join the community of over 1 million readers\n\nSign Up to Scribd to continue downloading\n\nSign up for a Scribd 30 day free trial to download this document plus get access to the world's largest digital library.\n\nCancel anytime.","link":"https:\/\/www.slideshare.net\/Phdtopiccom\/research-topics-in-information-technology","pub_date":"2021-10-08 11:26:57","topic":"news"},{"title":"Why is there no Nobel Prize in technology?","summary":"As the world focuses its attention on this year's recipients of the planet's most prestigious prize, the Nobel, it feels like something's missing from the list: technology.Swedish inventor Alfred Nobel established the prizes more than century ago with the instruction that his entire estate be used to endow 'prizes to those who, during the preceding year, shall have conferred the greatest benefit to mankind.' The categories laid out in his will—physics, chemistry, physiology or medicine, and peac","link":"https:\/\/qz.com\/1092758\/nobel-prize-2017-why-is-there-no-nobel-prize-in-technology\/","pub_date":"2021-10-07 22:15:00","topic":"news"},{"title":"ARISE Fellowships for technology developers","summary":"About the team\/job\nIn the frame of ARISE (Career Accelerator for Research Infrastructure Scientists) programme, we are looking for experienced professionals with a background in the fields of computation engineering and data sciences\/ imaging and optical engineering\/ mechanical engineering or molecular biotechnology, eager to develop novel technologies for life sciences and get trained to operate life science research infrastructures of tomorrow. \nThe programme receives funding from Horizon 2020","link":"https:\/\/www.nature.com\/naturecareers\/job\/arise-fellowships-for-technology-developers-european-molecular-biology-laboratory-embl-745420","pub_date":"2021-10-03 12:15:00","topic":"economics"},{"title":"Will technology solve education inequality?","summary":"As Harvard analyst, Deval Patrick, truthfully pointed out once: 'When there's inequity in learning, it's usually baked into life.'The quality of education we receive as children and young adults directly impacts the quality of life we enjoy later. A good education allows us to work, develop and ultimately live a more secure and happier life. Receiving an inadequate education, on the other hand, can significantly hinder our personal development.About the authorHugo Aguirre is the development and ","link":"https:\/\/www.techradar.com\/news\/will-technology-solve-education-inequality","pub_date":"2021-10-04 11:09:14","topic":"tech"},{"title":"KeyBanc Downgrades Akamai Technologies","summary":"#Price Action#Akam#GuardicoreTerms of UsePrivacy PolicyDo Not Sell My InfoHelp CenterAboutKeyBanc analyst Brandon Nispel downgraded Akamai Technologies Inc (NASDAQ:AKAM) to Sector Weight from Overweight without a price target following the company's acquisition of GuardiCore. Dilution from the acquisition \"details\" the near-term view on the shares, Nispel notes. The thesis that Akamai would utilize its \"significant\" free cash flow position to...markets.businessinsider.com","link":"https:\/\/markets.businessinsider.com\/news\/stocks\/keybanc-downgrades-akamai-technologies---read-why-1030840035","pub_date":"2021-10-04 10:50:40","topic":"news"}]