[{"title":"World Business Report, Businesses hit by Facebook outage","summary":"Following an extended outage of Facebook services we hear about the impact on businesses. And we examine the wider implications of the problems faced by WhatsApp, Instagram and Facebook, with Dan Cooper, senior editor at Engadget. Also in the programme, for four days in a row, Chinese warplanes have flown close to Taiwan. The island's president Tsai Ing-wen has warned in an article for Foreign Affairs magazine that there would be \"catastrophic\" consequences for peace and democracy in Asia if it ","link":"https:\/\/www.bbc.co.uk\/programmes\/p09xt3zg","pub_date":"2021-10-05 17:00:00","topic":"news"},{"title":"Fowl Business","summary":"Fowl business: if you've ever seen a guinea fowl rushing along, apparently compelled by extreme urgency, they're very funny! Happened several times today at Maple Glen Garden in Southland, New Zealand. And by the way, they can be noisy! ~pics taken when they were more chilled out. Click on any photo to enlarge. Committee meeting 🙂 Text and photos by Liz, Catchy heading by Nigel; Exploring Colour (2021)","link":"https:\/\/exploringcolour.wordpress.com\/2021\/10\/03\/fowl-business\/","pub_date":"2021-10-03 10:09:14","topic":"news"},{"title":"Small Business","summary":"Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset. Powered and implemented by FactSet Digital Solutions. Legal Statement. Mutual Fund and ETF data provided by Refinitiv Lipper.\n\nThis material may not be published, broadcast, rewritten, or redistributed. ©2021 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy","link":"https:\/\/www.foxbusiness.com\/small-business","pub_date":"2021-10-05 17:45:00","topic":"news"},{"title":"Transforming Business","summary":"With each passing year, each new disruption, each global challenge, what it means to be a transformative business leader evolves. In this special series, we spotlight visionaries who are making change around the world and explore the principles and playbooks that guide them.","link":"https:\/\/www.businessinsider.com\/tb\/the-people-transforming-business-in-2020-9","pub_date":"2021-10-08 20:00:00","topic":"news"},{"title":"Business+Tech","summary":"Technology has a profound impact on business — shaping the way it is conducted, how products and services are developed and offered, and how people interact with organizations. Our faculty, alumni, and centers and institutes are at the forefront of the intersection of business and technology, and are leading change through both research and practice. Business+Tech builds on these efforts, equipping students with a technology foundation they can use to positively impact business and society.  \n \n","link":"https:\/\/michiganross.umich.edu\/about\/business-tech","pub_date":"2021-10-06 17:05:40","topic":"science"}]